<?php
class baddet{
    static function detect($str){
        static $bad_words = array('共产党','习近平','李克强','张德江','俞正声','刘云山','王岐山','张高丽','马凯','王沪宁','刘延东','刘奇葆','许其亮','孙春兰','孙政才','李建国','李源潮','汪洋','张春贤','范长龙','孟建柱','赵乐际','胡春华','栗战书','郭金龙','韩正','杜青林','赵洪祝','杨晶','王胜俊','陈昌智','严隽琪','王晨','沈跃跃','吉炳轩','张平','向巴平措','艾力更','依明巴海','万鄂湘','张宝文','陈竺','令计划','韩启德','帕巴拉','格列朗杰','董建华','万钢','林文漪','罗富和','何厚铧','张庆黎','李海峰','苏荣','陈元','卢展工','周小川','王家瑞','王正伟','马飚','齐续春','陈晓光','马培华','刘晓峰','王钦敏','大奶','阴唇','淫水','鸡巴','成人电影','性爱','成人BT','阴茎','法轮','江泽民','毛泽东','邓小平','奸淫','淫奸','淫穴','肛交','性交','做爱','政府','巨乳','龟头','阴道','幼女','嫩逼','阴蒂','强奸','阴毛','淫妹','嫩穴','操逼','轮奸','高潮','淫乱','淫女','淫B','射精','肉棒','狂操','小穴','开苞','春药','精子','淫液','薄一波','文化大革命','達賴','达赖','乳房','全裸','裸体','相奸','他妈的','你娘','喷尿','美逼','抽插','阴穴','乡巴佬','你妈','裸','脱衣','无码','有码','無碼','有碼','退黨','退党','骚妹','干你','日你','操你','草你');

        $maxlen = 0;$minlen = 1024*128;
        foreach($bad_words as $v){
            $len = strlen($v);
            if($len <1) continue;
            if($len > $maxlen) $maxlen = $len;
            if($len < $minlen) $minlen = $len;
        }
        $len = strlen($str);
        $pos = 0;
        while($pos < $len){
            if($pos + $maxlen > $len) $maxlen = $len - $pos;
            $found = false; $key = $str;
            //for($i = 0;$i<$maxlen;++$i) $key .= $str[$i+$pos];
            for($i = $maxlen;$i >= $minlen;--$i){
                $key1 = substr($key,0,$i);
                if(in_array($key1,$bad_words)){
                    $found = true;
                    return $found;
                    break;
                }
            }
            if(!$found) $pos++;
        }
    }
}